{
  "jurisdiction": "US-CA",
  "provision": [
    {
      "subdivision": "code",
      "number": "Corporations Code"
    },
    {
      "subdivision": "title",
      "number": "2"
    },
    {
      "subdivision": "chapter",
      "number": "5"
    },
    {
      "subdivision": "article",
      "number": "4"
    },
    {
      "subdivision": "section",
      "number": "16404"
    }
  ],
  "content": [
    {
      "number": "(a)",
      "content": "The fiduciary duties a partner owes to the partnership and the other partners are the duty of loyalty and the duty of care set forth in subdivisions (b) and (c)."
    },
    {
      "number": "(b)",
      "content": [
        {
          "type": "paragraph",
          "text": "A partner’s duty of loyalty to the partnership and the other partners includes all of the following:"
        },
        {
          "number": "(1)",
          "content": "To account to the partnership and hold as trustee for it any property, profit, or benefit derived by the partner in the conduct and winding up of the partnership business or derived from a use by the partner of partnership property or information, including the appropriation of a partnership opportunity."
        },
        {
          "number": "(2)",
          "content": "To refrain from dealing with the partnership in the conduct or winding up of the partnership business as or on behalf of a party having an interest adverse to the partnership."
        },
        {
          "number": "(3)",
          "content": "To refrain from competing with the partnership in the conduct of the partnership business before the dissolution of the partnership."
        }
      ]
    },
    {
      "number": "(c)",
      "content": "A partner’s duty of care to the partnership and the other partners in the conduct and winding up of the partnership business is limited to refraining from engaging in grossly negligent or reckless conduct, intentional misconduct, or a knowing violation of law."
    },
    {
      "number": "(d)",
      "content": "A partner shall discharge the duties to the partnership and the other partners under this chapter or under the partnership agreement and exercise any rights consistently with the obligation of good faith and fair dealing."
    },
    {
      "number": "(e)",
      "content": "A partner does not violate a duty or obligation under this chapter or under the partnership agreement merely because the partner’s conduct furthers the partner’s own interest."
    },
    {
      "number": "(f)",
      "content": "A partner may lend money to and transact other business with the partnership, and as to each loan or transaction, the rights and obligations of the partner regarding performance or enforcement are the same as those of a person who is not a partner, subject to other applicable law."
    },
    {
      "number": "(g)",
      "content": "This section applies to a person winding up the partnership business as the personal or legal representative of the last surviving partner as if the person were a partner."
    }
  ],
  "history": [
    "Added by Stats. 1996, Ch. 1003, Sec. 2. Effective January 1, 1997."
  ]
}
