{
  "jurisdiction": "US-CA",
  "provision": [
    {
      "subdivision": "code",
      "number": "Corporations Code"
    },
    {
      "subdivision": "title",
      "number": "2"
    },
    {
      "subdivision": "chapter",
      "number": "5"
    },
    {
      "subdivision": "article",
      "number": "9"
    },
    {
      "subdivision": "section",
      "number": "16915"
    }
  ],
  "content": [
    {
      "number": "(a)",
      "content": [
        {
          "type": "paragraph",
          "text": "In a merger involving a domestic partnership, in which another partnership or a foreign other business entity is a party, but in which no other domestic other business entity is a party, the surviving partnership or surviving foreign other business entity may file with the Secretary of State a statement that one or more partnerships have merged into the surviving partnership or surviving foreign other business entity, or that one or more partnerships or foreign other business entities have merged into the surviving domestic partnership. A statement of merger shall contain the following:"
        },
        {
          "number": "(1)",
          "content": "The name of each partnership or foreign other business entity that is a party to the merger."
        },
        {
          "number": "(2)",
          "content": "The name of the surviving entity into which the other partnerships or foreign other business entities were merged."
        },
        {
          "number": "(3)",
          "content": "The street address of the surviving entity’s chief executive office and of an office in this state, if any."
        },
        {
          "number": "(4)",
          "content": "Whether the surviving entity is a partnership or a foreign other business entity, specifying the type of the entity."
        }
      ]
    },
    {
      "number": "(b)",
      "content": [
        {
          "type": "paragraph",
          "text": "In a merger involving a domestic partnership in which a domestic other business entity is also a party, after approval of the merger by the constituent partnerships and any constituent other business entities, the constituent partnerships and constituent other business entities shall file a certificate of merger in the office of, and on a form prescribed by, the Secretary of State, but if the surviving entity is a domestic corporation or a foreign corporation in a merger in which a domestic corporation is a constituent party, the surviving corporation shall file in the office of the Secretary of State a copy of the agreement of merger and attachments required under paragraph (1) of subdivision (g) of Section 1113. The certificate of merger shall be executed and acknowledged by each domestic constituent partnership by two partners (unless a lesser number is provided in the partnership agreement) and by each foreign constituent partnership by one or more partners, and by each constituent other business entity by those persons required to execute the certificate of merger by the laws under which the constituent other business entity is organized. The certificate of merger shall set forth all of the following:"
        },
        {
          "number": "(1)",
          "content": "The names and the Secretary of State’s file numbers, if any, of each of the constituent partnerships and constituent other business entities, separately identifying the disappearing partnerships and disappearing other business entities and the surviving partnership or surviving other business entity."
        },
        {
          "number": "(2)",
          "content": "If a vote of the partners was required under Section 16911, a statement that the principal terms of the agreement of merger were approved by a vote of the partners, which equaled or exceeded the vote required."
        },
        {
          "number": "(3)",
          "content": "If the surviving entity is a domestic partnership and not an other business entity, any change to the information set forth in any filed statement of partnership authority of the surviving partnership resulting from the merger, including any change in the name of the surviving partnership resulting from the merger. The filing of a certificate of merger setting forth any changes to any filed statement of partnership authority of the surviving partnership shall have the effect of the filing of a certificate of amendment of the statement of partnership authority by the surviving partnership, and the surviving partnership need not file a certificate of amendment under Section 16105 to reflect those changes."
        },
        {
          "number": "(4)",
          "content": "The future effective date or time (which shall be a date or time certain not more than 90 days subsequent to the date of filing) of the merger, if the merger is not to be effective upon the filing of the certificate of merger with the office of the Secretary of State."
        },
        {
          "number": "(5)",
          "content": "If the surviving entity is an other business entity or a foreign partnership, the full name, type of entity, legal jurisdiction in which the entity was organized and by whose laws its internal affairs are governed, and the address of the principal place of business of the entity."
        },
        {
          "number": "(6)",
          "content": "Any other information required to be stated in the certificate of merger by the laws under which each constituent other business entity is organized."
        }
      ]
    },
    {
      "number": "(c)",
      "content": "A statement of merger or a certificate of merger, as is applicable under subdivision (a) or (b), shall have the effect of the filing of a cancellation for each disappearing partnership of any statement of partnership authority filed by it, and shall have the effect of filing the notice of cessation required by Section 16954 or 16960, if applicable."
    }
  ],
  "history": [
    "Amended by Stats. 2014, Ch. 834, Sec. 33. Effective January 1, 2015."
  ]
}
