{
  "jurisdiction": "US-CA",
  "provision": [
    {
      "subdivision": "code",
      "number": "Corporations Code"
    },
    {
      "subdivision": "title",
      "number": "2"
    },
    {
      "subdivision": "chapter",
      "number": "5"
    },
    {
      "subdivision": "article",
      "number": "5"
    },
    {
      "subdivision": "section",
      "number": "16504"
    }
  ],
  "content": [
    {
      "number": "(a)",
      "content": "On application by a judgment creditor of a partner or of a partner’s transferee, a court having jurisdiction may charge the transferable interest of the judgment debtor to satisfy the judgment. The court may appoint a receiver of the share of the distributions due or to become due to the judgment debtor in respect of the partnership and make all other orders, directions, accounts, and inquiries the judgment debtor might have made or that the circumstances of the case may require."
    },
    {
      "number": "(b)",
      "content": "A charging order constitutes a lien on the judgment debtor’s transferable interest in the partnership. The court may order a foreclosure of the interest subject to the charging order at any time. The purchaser at the foreclosure sale has the rights of a transferee."
    },
    {
      "number": "(c)",
      "content": [
        {
          "type": "paragraph",
          "text": "At any time before foreclosure, an interest charged may be redeemed in any of the following manners:"
        },
        {
          "number": "(1)",
          "content": "By the judgment debtor."
        },
        {
          "number": "(2)",
          "content": "With property other than partnership property, by one or more of the other partners."
        },
        {
          "number": "(3)",
          "content": "With partnership property, by one or more of the other partners with the consent of all of the partners whose interests are not so charged."
        }
      ]
    },
    {
      "number": "(d)",
      "content": "This chapter does not deprive a partner of a right under exemption laws with respect to the partner’s interest in the partnership."
    },
    {
      "number": "(e)",
      "content": "This section provides the exclusive remedy by which a judgment creditor of a partner or partner’s transferee may satisfy a judgment out of the judgment debtor’s transferable interest in the partnership."
    }
  ],
  "history": [
    "Added by Stats. 1996, Ch. 1003, Sec. 2. Effective January 1, 1997."
  ]
}
