{
  "jurisdiction": "US-CA",
  "provision": [
    {
      "subdivision": "code",
      "number": "Corporations Code"
    },
    {
      "subdivision": "title",
      "number": "2"
    },
    {
      "subdivision": "chapter",
      "number": "5"
    },
    {
      "subdivision": "article",
      "number": "10"
    },
    {
      "subdivision": "section",
      "number": "16954"
    }
  ],
  "content": [
    {
      "number": "(a)",
      "content": "The registration of a registered limited liability partnership may be amended by an amended registration executed by one or more partners authorized to execute an amended registration and filed with the Secretary of State, as soon as reasonably practical after any information set forth in the registration or previously filed amended registration becomes inaccurate or to add information to the registration or amended registration."
    },
    {
      "number": "(b)",
      "content": "If a registered limited liability partnership ceases to be a registered limited liability partnership, it shall file with the Secretary of State a notice, executed by one or more partners authorized to execute the notice, that it is no longer a registered limited liability partnership. The notice shall state that a final annual tax return, as described by Section 17948.3 of the Revenue and Taxation Code, has been or will be filed with the Franchise Tax Board, as required under Part 10.2 (commencing with Section 18401) of Division 2 of the Revenue and Taxation Code."
    },
    {
      "number": "(c)",
      "content": "An amendment pursuant to subdivision (a) and a notice pursuant to subdivision (b) shall each be accompanied by a fee as set forth in subdivision (c) of Section 12189 of the Government Code."
    },
    {
      "number": "(d)",
      "content": "The Secretary of State shall provide forms for an amended registration under subdivision (a) and a notice under subdivision (b)."
    },
    {
      "number": "(e)",
      "content": "A notice of cessation, signed pursuant to subdivision (b), shall be filed with the Secretary of State. The Secretary of State shall notify the Franchise Tax Board of the cessation."
    }
  ],
  "history": [
    "Amended by Stats. 2006, Ch. 773, Sec. 39. Effective September 29, 2006."
  ]
}
