{
  "jurisdiction": "US-CA",
  "provision": [
    {
      "subdivision": "code",
      "number": "Corporations Code"
    },
    {
      "subdivision": "title",
      "number": "2"
    },
    {
      "subdivision": "chapter",
      "number": "5"
    },
    {
      "subdivision": "article",
      "number": "10"
    },
    {
      "subdivision": "section",
      "number": "16955"
    }
  ],
  "content": [
    {
      "number": "(a)",
      "content": "A domestic partnership, other than a limited partnership, may convert to a registered limited liability by the vote of the partners possessing a majority of the interests of its partners in the current profits of the partnership or by a different vote as may be required in its partnership agreement."
    },
    {
      "number": "(b)",
      "content": [
        {
          "type": "paragraph",
          "text": "When such a conversion takes effect, all of the following apply:"
        },
        {
          "number": "(1)",
          "content": "All property, real and personal, tangible and intangible, of the converting partnership remains vested in the converted registered limited liability partnership."
        },
        {
          "number": "(2)",
          "content": "All debts, obligations, liabilities, and penalties of the converting partnership continue as debts, obligations, liabilities, and penalties of the converted registered limited liability partnership."
        },
        {
          "number": "(3)",
          "content": "Any action, suit, or proceeding, civil or criminal, then pending by or against the converting partnership may be continued as if the conversion had not occurred."
        },
        {
          "number": "(4)",
          "content": "To the extent provided in the agreement of conversion and in this chapter, the partners of a partnership shall continue as partners in the converted registered limited liability partnership."
        },
        {
          "number": "(5)",
          "content": "A partnership that has been converted to a registered limited liability partnership pursuant to this chapter is the same person that existed prior to the conversion."
        }
      ]
    }
  ],
  "history": [
    "Added by Stats. 1996, Ch. 1003, Sec. 2. Effective January 1, 1997."
  ]
}
